documents/images/graphio/stdlib/convert_vector3_surfaceshader.dot
digraph {
  rankdir = LR;
    NG_convert_vector3_surfaceshader_surface [label= "surface_unlit"];
    NG_convert_vector3_surfaceshader_surface[shape = box];
    NG_convert_vector3_surfaceshader_surface ->     NG_convert_vector3_surfaceshader_out;
    NG_convert_vector3_surfaceshader_out [label= "out"];
    NG_convert_vector3_surfaceshader_out[shape = box]; 
    NG_convert_vector3_surfaceshader_vec3_to_color3 [label= "convert"];
    NG_convert_vector3_surfaceshader_vec3_to_color3[shape = box];
    NG_convert_vector3_surfaceshader_vec3_to_color3 ->     NG_convert_vector3_surfaceshader_surface [label= "emission_color"];
    NG_convert_vector3_surfaceshader_surface [label= "surface_unlit"];
    NG_convert_vector3_surfaceshader_surface[shape = box]; 
    NG_convert_vector3_surfaceshader_inINT [label="in"];
    NG_convert_vector3_surfaceshader_inINT [shape = ellipse];
    NG_convert_vector3_surfaceshader_vec3_to_color3 [label="convert"];
    NG_convert_vector3_surfaceshader_inINT -> NG_convert_vector3_surfaceshader_vec3_to_color3 [label=".in"];
}
